<?xml version="1.0"?>
<net name="Model2" version="11">
	<layers>
		<layer id="1" name="x" type="Parameter" version="opset1">
			<data shape="2708,1433" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="x">
					<dim>2708</dim>
					<dim>1433</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="edge_index" type="Parameter" version="opset1">
			<data shape="2,10556" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="edge_index">
					<dim>2</dim>
					<dim>10556</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="aten::zeros/Broadcast_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2708, 2708" offset="0" size="14666528" />
			<output>
				<port id="0" precision="FP16" names="17_1">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="aten::zeros/Broadcast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="8" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14666528" size="8" />
			<output>
				<port id="0" precision="I64" names="8" />
			</output>
		</layer>
		<layer id="5" name="aten::select/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
					<dim>10556</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32" names="18">
					<dim>10556</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="9" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14666536" size="8" />
			<output>
				<port id="0" precision="I64" names="9" />
			</output>
		</layer>
		<layer id="7" name="aten::select/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
					<dim>10556</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32" names="19">
					<dim>10556</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="aten::index_put_/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>10556</dim>
				</port>
				<port id="1" precision="I32">
					<dim>10556</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>10556</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="aten::index_put_/ShapeOf_0" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>10556</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="aten::index_put_/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>10556</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>10556</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_242" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="14666544" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="12" name="aten::index_put_/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>10556</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>10556</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_2519" type="Const" version="opset1">
			<data element_type="i32" shape="1, 1" offset="14666548" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="aten::index_put_/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>10556</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>10556</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_2520" type="Const" version="opset1">
			<data element_type="i32" shape="1, 1" offset="14666548" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="aten::index_put_/Mod" type="Mod" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>10556</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>10556</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="aten::index_put_/Broadcast_2" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>10556</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>10556</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="aten::index_put_/Unsqueeze_3" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>10556</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>10556</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_2521" type="Const" version="opset1">
			<data element_type="i32" shape="1, 1" offset="14666548" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="aten::index_put_/Add_6" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>10556</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>10556</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_2522" type="Const" version="opset1">
			<data element_type="i32" shape="1, 1" offset="14666548" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="aten::index_put_/Mod_7" type="Mod" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>10556</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>10556</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="aten::index_put_/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="I32">
					<dim>10556</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>10556</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>10556</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="aten::tensor/ConvertLike_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="14666552" size="2" />
			<output>
				<port id="0" precision="FP16" names="22" />
			</output>
		</layer>
		<layer id="25" name="aten::tensor/ConvertLike" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="26" name="aten::index_put_/Broadcast_9" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>10556</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="aten::index_put_/ScatterNDUpdate" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
				<port id="1" precision="I32">
					<dim>10556</dim>
					<dim>2</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>10556</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="17_2">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="ShapeOf_2555" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>2708</dim>
					<dim>1433</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_2556" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14666528" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="30" name="Constant_2557" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14666528" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="31" name="Gather_2558" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="14,num_nodes.1" />
			</output>
		</layer>
		<layer id="32" name="Convert_2559" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I32" />
			</output>
		</layer>
		<layer id="33" name="aten::eye/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="14666554" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="34" name="aten::eye/Eye" type="Eye" version="opset9">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="aten::eye/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="25">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="aten::add_/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="17,adjacency.1">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14666536" size="8" />
			<output>
				<port id="0" precision="I64" names="3">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="aten::sum/ReduceSum" type="ReduceSum" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="27,degree.1">
					<dim>2708</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_2523_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1" offset="14666558" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_2523" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="aten::gt/Greater" type="Greater" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2708</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="28">
					<dim>2708</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_2524_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1" offset="14666560" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_2524" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="aten::pow/Power" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2708</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="29">
					<dim>2708</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="aten::zeros_like/Constant_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="14666558" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="46" name="aten::zeros_like/Constant" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="47" name="aten::zeros_like/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>2708</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="aten::zeros_like/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="30">
					<dim>2708</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="aten::where/Select" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>2708</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2708</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2708</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="31,norm.1">
					<dim>2708</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="aten::t/Equal" type="Const" version="opset1">
			<data element_type="boolean" shape="" offset="14666562" size="1" />
			<output>
				<port id="0" precision="BOOL" />
			</output>
		</layer>
		<layer id="51" name="aten::t/If" type="If" version="opset8">
			<else_port_map>
				<input external_port_id="1" internal_layer_id="0" />
				<output external_port_id="2" internal_layer_id="1" />
			</else_port_map>
			<then_port_map>
				<input external_port_id="1" internal_layer_id="0" />
				<output external_port_id="2" internal_layer_id="3" />
			</then_port_map>
			<input>
				<port id="0" precision="BOOL" />
				<port id="1" precision="FP32">
					<dim>2708</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="32">
					<dim>1</dim>
					<dim>2708</dim>
				</port>
			</output>
			<then_body>
				<layers>
					<layer id="0" name="Parameter_93" type="Parameter" version="opset1">
						<data shape="2708,1" element_type="f32" />
						<output>
							<port id="0" precision="FP32">
								<dim>2708</dim>
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="Constant_2457" type="Const" version="opset1">
						<data element_type="i64" shape="2" offset="14666563" size="16" />
						<rt_info>
							<attribute name="precise" version="0" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>2</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="aten::t/Transpose" type="Reshape" version="opset1">
						<data special_zero="true" />
						<input>
							<port id="0" precision="FP32">
								<dim>2708</dim>
								<dim>1</dim>
							</port>
							<port id="1" precision="I64">
								<dim>2</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>2708</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="Result_96" type="Result" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>2708</dim>
							</port>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
					<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
					<edge from-layer="2" from-port="2" to-layer="3" to-port="0" />
				</edges>
				<rt_info />
			</then_body>
			<else_body>
				<layers>
					<layer id="0" name="Parameter_97" type="Parameter" version="opset1">
						<data shape="1,2708" element_type="f32" />
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>2708</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="Result_98" type="Result" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>2708</dim>
							</port>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="1" to-port="0" />
				</edges>
				<rt_info />
			</else_body>
		</layer>
		<layer id="52" name="aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2708</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2708</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="33,norm.7">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="34,norm.11">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_18_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 1433" offset="14666579" size="183424" />
			<output>
				<port id="0" precision="FP16" names="13,self.gcn.linear.weight">
					<dim>64</dim>
					<dim>1433</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_18" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1433</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1433</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2708</dim>
					<dim>1433</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1433</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2708</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_2525_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64" offset="14850003" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_2525" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2708</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="35,x.9">
					<dim>2708</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>2708</dim>
					<dim>2708</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2708</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="36,out.1">
					<dim>2708</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="aten::relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2708</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="37,h.1">
					<dim>2708</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_14_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="7, 64" offset="14850131" size="896" />
			<output>
				<port id="0" precision="FP16" names="11,self.out.weight">
					<dim>7</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_14" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="aten::linear/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2708</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2708</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_2526_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 7" offset="14851027" size="14" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_2526" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="aten::linear/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2708</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="z.1">
					<dim>2708</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Result_126" type="Result" version="opset1" output_names="z.1">
			<input>
				<port id="0" precision="FP32">
					<dim>2708</dim>
					<dim>7</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="0" from-port="0" to-layer="7" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="56" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="28" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="27" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="5" to-port="1" />
		<edge from-layer="4" from-port="0" to-layer="5" to-port="2" />
		<edge from-layer="4" from-port="0" to-layer="7" to-port="2" />
		<edge from-layer="5" from-port="3" to-layer="10" to-port="0" />
		<edge from-layer="5" from-port="3" to-layer="8" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="1" />
		<edge from-layer="7" from-port="3" to-layer="8" to-port="1" />
		<edge from-layer="7" from-port="3" to-layer="17" to-port="0" />
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="1" />
		<edge from-layer="9" from-port="1" to-layer="17" to-port="1" />
		<edge from-layer="9" from-port="1" to-layer="26" to-port="1" />
		<edge from-layer="10" from-port="2" to-layer="12" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1" />
		<edge from-layer="11" from-port="0" to-layer="18" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="14" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="16" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="1" />
		<edge from-layer="16" from-port="2" to-layer="23" to-port="0" />
		<edge from-layer="17" from-port="2" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="2" to-layer="20" to-port="0" />
		<edge from-layer="19" from-port="0" to-layer="20" to-port="1" />
		<edge from-layer="20" from-port="2" to-layer="22" to-port="0" />
		<edge from-layer="21" from-port="0" to-layer="22" to-port="1" />
		<edge from-layer="22" from-port="2" to-layer="23" to-port="1" />
		<edge from-layer="23" from-port="2" to-layer="27" to-port="1" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="26" to-port="0" />
		<edge from-layer="26" from-port="2" to-layer="27" to-port="2" />
		<edge from-layer="27" from-port="3" to-layer="36" to-port="0" />
		<edge from-layer="28" from-port="1" to-layer="31" to-port="0" />
		<edge from-layer="29" from-port="0" to-layer="31" to-port="1" />
		<edge from-layer="30" from-port="0" to-layer="31" to-port="2" />
		<edge from-layer="31" from-port="3" to-layer="32" to-port="0" />
		<edge from-layer="32" from-port="1" to-layer="34" to-port="0" />
		<edge from-layer="32" from-port="1" to-layer="34" to-port="1" />
		<edge from-layer="33" from-port="0" to-layer="34" to-port="2" />
		<edge from-layer="34" from-port="3" to-layer="35" to-port="0" />
		<edge from-layer="35" from-port="1" to-layer="36" to-port="1" />
		<edge from-layer="36" from-port="2" to-layer="38" to-port="0" />
		<edge from-layer="36" from-port="2" to-layer="53" to-port="1" />
		<edge from-layer="37" from-port="0" to-layer="38" to-port="1" />
		<edge from-layer="38" from-port="2" to-layer="41" to-port="0" />
		<edge from-layer="38" from-port="2" to-layer="44" to-port="0" />
		<edge from-layer="38" from-port="2" to-layer="47" to-port="0" />
		<edge from-layer="39" from-port="0" to-layer="40" to-port="0" />
		<edge from-layer="40" from-port="1" to-layer="41" to-port="1" />
		<edge from-layer="41" from-port="2" to-layer="49" to-port="0" />
		<edge from-layer="42" from-port="0" to-layer="43" to-port="0" />
		<edge from-layer="43" from-port="1" to-layer="44" to-port="1" />
		<edge from-layer="44" from-port="2" to-layer="49" to-port="1" />
		<edge from-layer="45" from-port="0" to-layer="46" to-port="0" />
		<edge from-layer="46" from-port="1" to-layer="48" to-port="0" />
		<edge from-layer="47" from-port="1" to-layer="48" to-port="1" />
		<edge from-layer="48" from-port="2" to-layer="49" to-port="2" />
		<edge from-layer="49" from-port="3" to-layer="51" to-port="1" />
		<edge from-layer="49" from-port="3" to-layer="52" to-port="0" />
		<edge from-layer="50" from-port="0" to-layer="51" to-port="0" />
		<edge from-layer="51" from-port="2" to-layer="52" to-port="1" />
		<edge from-layer="52" from-port="2" to-layer="53" to-port="0" />
		<edge from-layer="53" from-port="2" to-layer="60" to-port="0" />
		<edge from-layer="54" from-port="0" to-layer="55" to-port="0" />
		<edge from-layer="55" from-port="1" to-layer="56" to-port="1" />
		<edge from-layer="56" from-port="2" to-layer="59" to-port="0" />
		<edge from-layer="57" from-port="0" to-layer="58" to-port="0" />
		<edge from-layer="58" from-port="1" to-layer="59" to-port="1" />
		<edge from-layer="59" from-port="2" to-layer="60" to-port="1" />
		<edge from-layer="60" from-port="2" to-layer="61" to-port="0" />
		<edge from-layer="61" from-port="1" to-layer="64" to-port="0" />
		<edge from-layer="62" from-port="0" to-layer="63" to-port="0" />
		<edge from-layer="63" from-port="1" to-layer="64" to-port="1" />
		<edge from-layer="64" from-port="2" to-layer="67" to-port="0" />
		<edge from-layer="65" from-port="0" to-layer="66" to-port="0" />
		<edge from-layer="66" from-port="1" to-layer="67" to-port="1" />
		<edge from-layer="67" from-port="2" to-layer="68" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2025.2.0-19140-c01cd93e24d-releases/2025/2" />
		<conversion_parameters>
			<framework value="pytorch" />
			<is_python_object value="True" />
		</conversion_parameters>
	</rt_info>
</net>
